---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSetIterator.MoveNext
source: html/4011603d-c2bd-ecc9-c89e-f6e7ecc52ed8.htm
---
# Autodesk.Revit.DB.Visual.AssetSetIterator.MoveNext Method

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```